In [17]:
import pandas as pd
import requests
import json
import datetime as dt
from prophet import Prophet

%matplotlib inline

In [18]:
!pip install prophet

Requirement already satisfied: prophet in c:\users\mdadv\anaconda\envs\dev\lib\site-packages (1.1.5)
Requirement already satisfied: cmdstanpy>=1.0.4 in c:\users\mdadv\anaconda\envs\dev\lib\site-packages (from prophet) (1.2.0)
Requirement already satisfied: numpy>=1.15.4 in c:\users\mdadv\anaconda\envs\dev\lib\site-packages (from prophet) (1.24.3)
Requirement already satisfied: matplotlib>=2.0.0 in c:\users\mdadv\anaconda\envs\dev\lib\site-packages (from prophet) (3.7.2)
Requirement already satisfied: pandas>=1.0.4 in c:\users\mdadv\anaconda\envs\dev\lib\site-packages (from prophet) (2.0.3)
Requirement already satisfied: holidays>=0.25 in c:\users\mdadv\anaconda\envs\dev\lib\site-packages (from prophet) (0.39)
Requirement already satisfied: tqdm>=4.36.1 in c:\users\mdadv\anaconda\envs\dev\lib\site-packages (from prophet) (4.65.0)
Requirement already satisfied: importlib-resources in c:\users\mdadv\anaconda\envs\dev\lib\site-packages (from prophet) (6.1.1)
Requirement already satisfied: stanio~=0.3.0 in c:\users\mdadv\anaconda\envs\dev\lib\site-packages (from cmdstanpy>=1.0.4->prophet) (0.3.0)
Requirement already satisfied: python-dateutil in c:\users\mdadv\anaconda\envs\dev\lib\site-packages (from holidays>=0.25->prophet) (2.8.2)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\mdadv\anaconda\envs\dev\lib\site-packages (from matplotlib>=2.0.0->prophet) (1.0.5)
Requirement already satisfied: cycler>=0.10 in c:\users\mdadv\anaconda\envs\dev\lib\site-packages (from matplotlib>=2.0.0->prophet) (0.11.0)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\mdadv\anaconda\envs\dev\lib\site-packages (from matplotlib>=2.0.0->prophet) (4.25.0)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\mdadv\anaconda\envs\dev\lib\site-packages (from matplotlib>=2.0.0->prophet) (1.4.4)
Requirement already satisfied: packaging>=20.0 in c:\users\mdadv\anaconda\envs\dev\lib\site-packages (from matplotlib>=2.0.0->prophet) (23.1)
Requirement already satisfied: pillow>=6.2.0 in c:\users\mdadv\anaconda\envs\dev\lib\site-packages (from matplotlib>=2.0.0->prophet) (9.4.0)
Requirement already satisfied: pyparsing<3.1,>=2.3.1 in c:\users\mdadv\anaconda\envs\dev\lib\site-packages (from matplotlib>=2.0.0->prophet) (3.0.9)
Requirement already satisfied: pytz>=2020.1 in c:\users\mdadv\anaconda\envs\dev\lib\site-packages (from pandas>=1.0.4->prophet) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\mdadv\anaconda\envs\dev\lib\site-packages (from pandas>=1.0.4->prophet) (2023.3)
Requirement already satisfied: colorama in c:\users\mdadv\anaconda\envs\dev\lib\site-packages (from tqdm>=4.36.1->prophet) (0.4.6)
Requirement already satisfied: six>=1.5 in c:\users\mdadv\anaconda\envs\dev\lib\site-packages (from python-dateutil->holidays>=0.25->prophet) (1.16.0)

In [19]:
m = Prophet()
m

In [28]:
lulu_lemon_df =lulu_lemon_df.rename(columns={'Month':'ds', 'lululemon Sales':'y'})

In [29]:
lulu_lemon_df.dropna()

          ds    y
1    2014-01   23
2    2014-02   20
3    2014-03   22
4    2014-04   20
5    2014-05   18
..       ...  ...
116  2023-08   63
117  2023-09   57
118  2023-10   61
119  2023-11  100
120  2023-12   91

[120 rows x 2 columns]

In [31]:
m.fit(lulu_lemon_df)

Exception: Prophet object can only be fit once. Instantiate a new object.

In [4]:
running_shorts_df = pd.read_csv("resources/running_shorts.csv")
running_shorts_df

                Category: All categories
Month    running shorts: (United States)
2014-01                               19
2014-02                               22
2014-03                               29
2014-04                               31
...                                  ...
2023-08                               56
2023-09                               42
2023-10                               33
2023-11                               34
2023-12                               29

[121 rows x 1 columns]

In [6]:
tennis_skirt_df = pd.read_csv('resources/tennis_skirt.csv')
tennis_skirt_df

              Category: All categories
Month    tennis skirt: (United States)
2014-01                              8
2014-02                              8
2014-03                             10
2014-04                              8
...                                ...
2023-08                             63
2023-09                             55
2023-10                             42
2023-11                             32
2023-12                             26

[121 rows x 1 columns]

In [7]:
lulu_lemon_df = pd.read_csv('resources/lululemon.csv')
lulu_lemon_df

           Category: All categories
Month    lululemon: (United States)
2014-01                          23
2014-02                          20
2014-03                          22
2014-04                          20
...                             ...
2023-08                          63
2023-09                          57
2023-10                          61
2023-11                         100
2023-12                          91

[121 rows x 1 columns]

In [8]:
lulu_lemon_df.columns

Index(['Category: All categories'], dtype='object')

In [9]:
lulu_lemon_df = pd.read_csv('resources/lululemon.csv', skiprows=1, header=None, names=['Month', 'lululemon Sales'])

In [10]:
lulu_lemon_df

       Month             lululemon Sales
0      Month  lululemon: (United States)
1    2014-01                          23
2    2014-02                          20
3    2014-03                          22
4    2014-04                          20
..       ...                         ...
116  2023-08                          63
117  2023-09                          57
118  2023-10                          61
119  2023-11                         100
120  2023-12                          91

[121 rows x 2 columns]

In [13]:
#lulu_lemon_df = lulu_lemon_df.drop(0)
#lulu_lemon_df.reset_index(drop = True)

In [14]:
lulu_lemon_df

       Month lululemon Sales
1    2014-01              23
2    2014-02              20
3    2014-03              22
4    2014-04              20
5    2014-05              18
..       ...             ...
116  2023-08              63
117  2023-09              57
118  2023-10              61
119  2023-11             100
120  2023-12              91

[120 rows x 2 columns]

In [15]:
lulu_lemon_df.rename(columns={'Month':'ds', 'lululemon Sales':'y'})

          ds    y
1    2014-01   23
2    2014-02   20
3    2014-03   22
4    2014-04   20
5    2014-05   18
..       ...  ...
116  2023-08   63
117  2023-09   57
118  2023-10   61
119  2023-11  100
120  2023-12   91

[120 rows x 2 columns]